bench/rheotool/cylinder_wi1.0_R50_shrunk15R/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          84;
        startFace       42941;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          274;
        startFace       43025;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       43299;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       43699;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          43384;
        startFace       43827;
    }
)

// ************************************************************************* //
